/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstclear.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: vwinfred <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/04/07 18:55:30 by vwinfred          #+#    #+#             */
/*   Updated: 2021/04/07 18:55:31 by vwinfred         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
 Удаляет и освобождает данный элемент и всех его последователей
 Укватель должен быть установлен на NULL
 */

void	ft_lstclear(t_list **lst, void (*del)(void *))
{
	t_list	*tmp;
	if (lst == NULL)
		return ;
	while (*lst)
	{
		(*del)((*lst)->content);
		tmp = (*lst);
		*lst = (*lst)->next;
		free(tmp);
	}
	*lst = NULL;
}
